import pymysql
from include.common import *

# 지역
region_list	= {"100260":"서울특별시", "100267":"부산광역시", "100269":"인천광역시", "100271":"대전광역시", "100272":"대구광역시", "100273":"울산광역시","100275":"광주광역시", "100276":"경기도", "100278":"강원특별자치도", "100280":"충청북도", "100281":"충청남도", "100282":"전북특별자치도", "100283":"전라남도", "100285":"경상북도", "100291":"경상남도", "100292":"제주도",}
# "전라북도" -> "전북특별자치도" 변경

# 학교유형1
sch1_list = {"100362":"일반고", "100363":"특성화고", "100364":"특수목적고", "100365":"자율고", "100366":"기타", "100322":"전문대학", "100323":"대학(4년제)",}

# 학교유형2
sch2_list = {"104228":"일반고", "100368":"대안교육", "100369":"직업교육", "100370":"기타", "100371":"과학계열", "100372":"외국어국제계열", "100373":"예술체육계열", "100374":"마이스터고", "100375":"자율형사립", "100376":"자율형공립", "100377":"영재학교", "100324":"전문대학", "100325":"기능대학", "100326":"사이버대학(2년제)", "100327":"각종대학(전문)", "100328":"일반대학", "100329":"교육대학", "100330":"산업대학", "100331":"사이버대학(대학)", "100332":"각종대학(대학)",}
# "기능대학(폴리텍대학)" -> "기능대학" 변경
# "사이버대학(4년제)" -> "사이버대학(대학)" 변경

# 설립유형
estType = {"100334":"국립", "100335":"사립", "100336":"공립",}

# 학과 계열
subject_list = {"100391":"인문계열", "100392":"사회계열", "100393":"교육계열", "100394":"공학계열", "100395":"자연계열", "100396":"의약계열", "100397":"예체능계열",}


cur = con.cursor()

input_list = {**region_list, **sch1_list, **sch2_list, **estType, **subject_list}

for code, name in input_list.items():
    query = f"INSERT INTO CAREER_DB.code_list (code, name, recv_time) VALUES ('{code}', '{name}', NOW()) on duplicate key update code='{code}', name='{name}', recv_time=NOW()"

    # print(query)
    cur.execute(query)

con.commit()
con.close()

# create table CAREER_DB.code_list (
#     code char(6) not null default '',
#     name varchar(50) not null default '',
#     recv_time DATETIME not null,
#     primary key(code)
# );